{
    "Lyrics": [
        [
            "[Verse 1]",
            "You can tell the world you never was my girl",
            "You can burn my clothes when I'm gone",
            "Or you can tell your friends just what a fool I've been",
            "And laugh and joke about me on the phone",
            "You can tell my arms go back to the farm",
            "You can tell my feet to hit the floor",
            "Or you can tell my lips to tell my fingertips",
            "They won't be reaching out for you no more",
            "",
            "[Chorus]",
            "But don't tell my heart, my achy breaky heart",
            "I just don't think he'd understand",
            "And if you tell my heart, my achy breaky heart",
            "He might blow up and kill this man, ooh",
            "",
            "[Verse 2]",
            "You can tell your ma I moved to Arkansas",
            "You can tell your dog to bite my leg",
            "Or tell your brother Cliff whose fist can tell my lip",
            "He never really liked me anyway",
            "Or tell your Aunt Louise, tell anything you please",
            "Myself already knows I'm not okay",
            "Or you can tell my eyes to watch out for my mind",
            "It might be walking out on me today",
            "",
            "[Chorus]",
            "But don't tell my heart, my achy breaky heart",
            "I just don't think he'd understand",
            "And if you tell my heart, my achy breaky heart",
            "He might blow up and kill this man, ooh",
            "",
            "[Chorus]",
            "Don't tell my heart, my achy breaky heart",
            "I just don't think he'd understand",
            "And if you tell my heart, my achy breaky heart",
            "He might blow up and kill this man",
            "",
            "[Chorus]",
            "Don't tell my heart, my achy breaky heart",
            "I just don't think he'd understand",
            "And if you tell my heart, my achy breaky heart",
            "He might blow up and kill this man, ooh-ooh"
        ]
    ],
    "Comments": [
        "Written by the country songwriter and performer Don Von Tress, this was a remake of a 1991 song by the country act the Marcy Brothers, titled “Don’t Tell My Heart”. That original version had the lyrics: “Don’t tell my heart, my achy, breakin' heart…”",
        "The song may have been a novelty, but it made the Some Gave All album the best seller of 1992.",
        "This was the first million-selling country single since “Islands in the Stream” by Kenny Rogers and Dolly Parton in 1983.",
        "'Achy Breaky Heart' at 25: Inside Billy Ray Cyrus' Polarizing Hit",
        "    ",
        "       — Rolling Stone",
        "\"Where were you 25 years ago?\" asks Billy Ray Cyrus, leaning in intently. The country singer, actor and dad to famous pop stars is seated in a room in the Nashville home and studio of the late Cowboy Jack Clement, but his mind is time traveling back to 1992, when one of the most polarizing songs in country music, \"Achy Breaky Heart,\" was dominating the airwaves."
    ],
    "Title": "Billy Ray Cyrus – Achy Breaky Heart Lyrics | Genius Lyrics",
    "Release date": "March 23, 1992"
}