{
    "Lyrics": [
        [
            "[Verse 1]",
            "Don't you know I'm no good for you?",
            "I've learned to lose you, can't afford to",
            "Tore my shirt to stop you bleedin'",
            "But nothin' ever stops you leavin'",
            "",
            "[Chorus]",
            "Quiet when I'm coming home and I'm on my own",
            "I could lie, say I like it like that, like it like that",
            "I could lie, say I like it like that, like it like that",
            "",
            "[Verse 2]",
            "Don't you know too much already?",
            "I'll only hurt you if you let me",
            "Call me friend, but keep me closer (Call me back)",
            "And I'll call you when the party's over",
            "",
            "[Chorus]",
            "Quiet when I'm coming home and I'm on my own",
            "And I could lie, say I like it like that, like it like that",
            "Yeah, I could lie, say I like it like that, like it like that",
            "",
            "[Bridge]",
            "But nothin' is better sometimes",
            "Once we've both said our goodbyes",
            "Let's just let it go",
            "Let me let you go",
            "",
            "[Chorus]",
            "Quiet when I'm coming home and I'm on my own",
            "I could lie, say I like it like that, like it like that",
            "I could lie, say I like it like that, like it like that"
        ]
    ],
    "Comments": [
        "The second single from WHEN WE ALL FALL ASLEEP, WHERE DO WE GO?, “when the party’s over,” sees Billie putting some distance between her and her lover. It was described by the singer not as a sad song, but rather as more of an angry mood.",
        "Its official release was first teased by Eilish’s brother (who also produced this track as well as many other Eilish songs), Finneas, on Twitter:",
        "Eilish later shared the official release in an Instagram post. In a later Instagram story, Eilish also confirmed the release of a music video in addition to the Spotify Vertical Video, saying:",
        "you are not even READY for the official video",
        "The video, released on October 25th, 2018, was inspired by fan artwork. It features Eilish crying thick, inky black tears, and reached #1 on YouTube trending in several countries, including the US.",
        "The song was first performed live on the 30th of January 2018 at The Tuning Fork in Auckland, New Zealand, and stayed in the setlist of the singer’s second tour, the “Where’s My Mind Tour.”",
        "Danish Translation",
        "Dutch Translation",
        "French Translation",
        "German Translation",
        "Hebrew Translation",
        "Italian Translation",
        "Persian Translation",
        "Polish Translation",
        "Portuguese Translation",
        "Spanish Translation",
        "Swedish Translation",
        "Turkish Translation",
        "It’s not really, “I’m sad,” you know what I mean? So “When The Party’s Over,” I feel like that’s such a sentence. It’s like, “I’ll call you when the party’s over,” you’re on the phone with someone and you can’t hear them, they can’t hear you, it’s loud, they’re mad at you for some reason. I feel like everybody’s had that struggle with someone – somebody on the phone yelling for some reason, and you’re just like, “You know what? Fucking leave me alone.”",
        "– Billie Eilish in a 2018 interview with coup de main.",
        "What’s kind of weird is that Finneas called it that “when the party’s over” when we wrote it because it’s kind of a sequel to “party favor”",
        "– Billie Eilish in a 2018 interview with coup de main.",
        "WTPO was really hard to record. This song is so important to us and since we’d already introduced you to it, we knew we had to do something unforgettable. Hundreds and hundreds of vocal layers later, I’m so proud of what we ended up with and I hope you love it as much as I do.",
        "– FINNEAS on Twitter",
        "In an interview with Fader magazine, Eilish admitted that it took over 90 takes to perfect the recording of the word— “Don’t” —that begins the track.",
        "Dan Reynolds, lead singer of Imagine Dragons tweeted:",
        "Billie’s brother FINNEAS explained to Vulture how the song came about:",
        "Conceptually, most of that song came to me on a drive home from the house of a girl I was dating. It’s one of those cases where I had left her house kind of for no reason. I just sort of had said, ‘Yeah, I gotta go home.’ I remember driving home, and there’s this freeway in L.A., the 2. I was driving down the 2 back to my house, and it’s a very kind of quiet freeway. It just turns around a mountain. I remember just having that quiet when I’m coming home, and I’m on my own. “I could lie, say I like it like that, like it like that.” When you’re the one putting an end to something, and you’re not actually happy about it, you’re not enjoying it, but you feel compelled to for some reason. I feel like there’s kind of a safety in not letting yourself become fully invested in something.",
        "Before the track’s official release, it had been performed several times throughout Eilish’s Where’s My Mind? Tour, (debuting in Aukland, New Zealand). Recordings of the original, softer version have since been uploaded to YouTube/SoundCloud.",
        "The artwork for the single cover was done by Switzerland-based tattoo artist Manuela Soto Sosa.",
        "Both Billie and Manuela confirmed the collaboration in Instagram posts, celebrating the release of the track.",
        "To achieve the black tears in the music video, tubes were threaded down to the corners of her eyes from across her forehead. A mixture of minerals and xanthan gum would then be pumped into her eyes, causing the liquid to stream down her face. A behind the scenes video details this process further.",
        "In an interview with NME, Eilish spoke of the planning process for the “when the party’s over” music video. She stated;",
        "I decided it was going to be a video and planned everything out like a director… I have this video of me being a fucking dick! I went into my yard and told my Mum to pretend to be me. I made her go outside with a table, glass and the chair in the position exactly where I wanted it and I started filming and deciding how we shot it and everything.",
        "In an Instagram post, Eilish also stated;",
        "i wrote down and drew everything, took a chair and small table to my backyard and had my mom pretend to be me so i could film exactly how i wanted the video to look. every frame, every angle, when and where i wanted it to zoom in and out, what i wanted to wear, exactly how i wanted to pick up and put down the glass. and when i wanted the black to leak from my eyes. (youll see that video one day) sent it to my people who sent it to carlos the director. he made that shit come to life. the shoot day was 12 hours long and we did maybe six full take with the black ink in my eyes..THAT SHIT WAS REALLY IN MY EYES OK THAT WAS VERY VERY REAL. DONT PLAY ME MAN THAT SHIT WAS REAL AND IT STUNG.",
        "During the week ending April 13, 2019, “when the party’s over” peaked at #29 on the Hot 100."
    ],
    "Title": "Billie Eilish – ​when the party's over Lyrics | Genius Lyrics",
    "Release date": "October 17, 2018"
}