{
    "Lyrics": [
        [
            "Lonely is the night when you find yourself alone",
            "Your demons come to light and your mind is not your own",
            "Lonely is the night when there's no one left to call",
            "You feel the time is right, say, the writing's on the wall, yeah",
            "",
            "And it's a high time to fight when the walls are closing in",
            "A-call it what you like, it's time you got to win",
            "Lonely, lonely, lonely, your spirit's sinking down",
            "You find you're not the only stranger in this town",
            "",
            "Red lights, green lights, stop and go jive",
            "Headlines, deadlines jamming your mind",
            "You been stealing shots from the side",
            "Let your feelings go for a ride",
            "",
            "There's danger out tonight, the man is on the prowl",
            "Get the dynamite, the boys are set to prowl",
            "Lonely is the night when you hear the voices call",
            "Are you ready for a fight? Do you wanna take it all?",
            "",
            "Slowdown, showdown, waiting on line",
            "Showtime, no time, changing your mind",
            "Streets are ringing, march to the sound",
            "Let your secrets follow you down",
            "",
            "Somebody's watching you, baby, so much you can do",
            "Nobody's stopping you, baby, from making it too",
            "One glimpse'll show you now, baby, what the music can do",
            "One kiss'll show you now, baby, it can happen to you",
            "",
            "No more sleeping, wasting our time",
            "Midnight creeping's first on our mind",
            "No more lazing around the TV",
            "You'll go crazy, come out with me",
            "",
            "Say you're lonely?",
            "Come out",
            "Lonely is the night",
            "A-you don't have to be lonely",
            "Come out",
            "Lonely is the night"
        ]
    ],
    "Comments": [
        "Billy Squire wrote this song about being alone in a room, perhaps a hotel room on a tour, and not knowing anyone in the town, or anything to do:",
        "‘Lonely Is The Night’ for example is nothing to do with the fact that I’m in a rock band, but it does have to do with the fact that you can be by yourself in a room somewhere and not know what to do, be scared to death of having to go out and find something."
    ],
    "Title": "Billy Squier – Lonely Is The Night Lyrics | Genius Lyrics"
}