{
    "Lyrics": [
        [
            "[Verse 1]",
            "Harry Truman, Doris Day, Red China, Johnnie Ray",
            "South Pacific, Walter Winchell, Joe DiMaggio",
            "Joe McCarthy, Richard Nixon, Studebaker, Television",
            "North Korea, South Korea, Marilyn Monroe",
            "Rosenbergs, H-Bomb, Sugar Ray, Panmunjom",
            "Brando, The King And I, and The Catcher In The Rye,",
            "Eisenhower, Vaccine, England's got a new queen",
            "Marciano, Liberace, Santayana goodbye",
            "",
            "[Chorus]",
            "We didn't start the fire",
            "It was always burning since the world's been turning",
            "We didn't start the fire",
            "No, we didn't light it, but we tried to fight it",
            "",
            "[Verse 2]",
            "Joseph Stalin, Malenkov, Nasser and Prokofiev",
            "Rockefeller, Campanella, Communist Bloc",
            "Roy Cohn, Juan Peron, Toscanini, Dacron",
            "Dien Bien Phu Falls, \"Rock Around the Clock\"",
            "Einstein, James Dean, Brooklyn's got a winning team",
            "Davy Crockett, Peter Pan, Elvis Presley, Disneyland",
            "Bardot, Budapest, Alabama, Khrushchev",
            "Princess Grace, Peyton Place, Trouble in the Suez",
            "",
            "[Chorus]",
            "We didn't start the fire",
            "It was always burning since the world's been turning",
            "We didn't start the fire",
            "No, we didn't light it, but we tried to fight it",
            "",
            "[Verse 3]",
            "Little Rock, Pasternak, Mickey Mantle, Kerouac",
            "Sputnik, Zhou En-lai, Bridge On The River Kwai,",
            "Lebanon, Charles de Gaulle, California baseball",
            "Starkweather Homicide, Children of Thalidomide",
            "Buddy Holly, Ben-Hur, Space Monkey, Mafia",
            "Hula Hoops, Castro, Edsel is a no-go",
            "U-2, Syngman Rhee, payola and Kennedy",
            "Chubby Checker, Psycho, Belgians in the Congo",
            "",
            "[Chorus]",
            "We didn't start the fire",
            "It was always burning since the world's been turning",
            "We didn't start the fire",
            "No, we didn't light it, but we tried to fight it",
            "",
            "[Verse 4]",
            "Hemingway, Eichmann, Stranger in a Strange Land,",
            "Dylan, Berlin, Bay of Pigs invasion",
            "Lawrence of Arabia, British Beatlemania",
            "Ole Miss, John Glenn, Liston beats Patterson",
            "Pope Paul, Malcolm X, British Politician sex",
            "J.F.K. blown away, what else do I have to say?",
            "",
            "[Chorus]",
            "We didn't start the fire",
            "It was always burning since the world's been turning",
            "We didn't start the fire",
            "No, we didn't light it, but we tried to fight it",
            "",
            "[Verse 5]",
            "Birth control, Ho Chi Minh, Richard Nixon back again",
            "Moonshot, Woodstock, Watergate, punk rock",
            "Begin, Reagan, Palestine, Terror on the airline",
            "Ayatollah's in Iran, Russians in Afghanistan",
            "Wheel of Fortune, Sally Ride, heavy metal suicide",
            "Foreign debts, homeless Vets, AIDS, crack, Bernie Goetz",
            "Hypodermics on the shores, China's under martial law",
            "Rock and Roller cola wars, I can't take it anymore",
            "",
            "[Chorus]",
            "We didn't start the fire",
            "It was always burning since the world's been turning",
            "We didn't start the fire",
            "But when we are gone",
            "It will still burn on, and on, and on, and on...",
            "We didn't start the fire",
            "It was always burning since the world's been turning",
            "We didn't start the fire",
            "No, we didn't light it, but we tried to fight it",
            "We didn't start the fire",
            "It was always burning since the world's been turning",
            "We didn't start the fire",
            "No, we didn't light it, but we tried to fight it",
            "We didn't start the fire",
            "It was always burning since the world's been turning",
            "We didn't start the fire",
            "No, we didn't light it, but we tried to fight it",
            "We didn't start the fire",
            "It was always burning since the world's been turning"
        ]
    ],
    "Comments": [
        "This monster hit of a song was created in 1989, when Joel turned 40. The idea spawned from a conversation he had with a friend of Sean Lennon. The friend just turned 21 and was complaining about how crazy it was to be living in his era, therefore undermining any other time before his. This encouraged Joel to write a song that would prove that any time is filled with extremes.",
        "Starting from 1949 (the year in which he was born), he chronicled the major events that occurred during that time in a rapid fire delivery of names, places, and cultural works.",
        "These are his words on the subject:",
        "I started doing that as a mental exercise. I had turned forty. It was 1989, and I said, “Okay, what’s happened in my life? I wrote down the year 1949… It was kind of a mind game. [It’s] one of the few times I’ve written the lyrics first, which should be obvious to why I usually prefer to write the music first, because the melody is horrendous. It’s like a mosquito droning. It’s one of the worst melodies I’ve ever written. I kind of like the lyric though.",
        "Passage taken from the book, In Their Own Words by Bill DeMain (Chapter 14) where he interviewed Joel about his thoughts on the song.",
        "The song reached #1 on the Billboard Hot 100 and became a radio mainstay.",
        "“We Didn’t Start the Fire” is a constant reminder that no matter how crazy times may seem today, they have always been crazy and will continue to be crazy as long as life continues to exist.",
        "It is a time capsule of political and cultural events that enlighten the listener to the moments that shape Billy Joel’s perspective of the world.",
        "Particularly striking is the pattern of events that succeeded World War II and led through the beginning, middle, and end of the Cold War. There are constant reminders that a devastating nuclear war threatened large populaces on the planet and though you yourself may live in a time of turmoil and struggle, Billy Joel plants the chronological stake that claims his formative years were shrouded by the universal acceptance of legitimate fears of the end of the world.",
        "Billy Joel has openly admitted that the structure of the song is basic and not up to par with most of his work. The song is performed with common instrumentation found in 1980’s pop rock. Bass guitar and drums maintain rhythm in the verses while synths and background vocals adorn the choruses. There are very few moments where Billy Joel’s vocals are silent, and this, as well as the uncharacteristically simple song structure, may have much to do with the focus of the song being the lyrics, almost exclusively. There is, however, a harmonic strategy that is rarely performed in covers and even in live versions of the song, and it leaves the song bereft of a major impact in its absence.",
        "“Cadence” is a musical term referring to a series of notes that end a musical phrase. A cadence can be either open or closed. You can think of an open cadence in music as a person pushing a boulder up a hill, and closed cadence is the relief of pushing the boulder down the other side. A musical example is in the Isley Brothers' “Shout” where the gospel jubilation of the rhythm is interrupted by a moment of soulful confession. The last note of the confession is held for an extended period (open cadence) before the excited gospel starts again. The closed cadence appears at the start of the next phrase, acting like an emotional see-saw.",
        "“We Didn’t Start the Fire” essentially follows the same pattern in the verses where the closed cadence is the start of the phrase and the open cadence can be heard in the rest of the phrase. However, the chorus – which acts like a merciful respite from the relentless bombardment of mementos in the verses – features a steadily played bass line that maintains a constant open cadence. This is accentuated by the fact that the line continues as the song fades out. The emotional result of this arrangement helps solidify the notion that time always moves forward and never stops, and this is especially felt during the lyric, “but when we are gone it will still burn on and on and on…”"
    ],
    "Title": "Billy Joel – We Didn't Start the Fire Lyrics | Genius Lyrics",
    "Release date": "October 17, 1989"
}