{
    "Lyrics": [
        [
            "[Intro: Billy Ray Cyrus]",
            "Oh, oh-oh",
            "Oh",
            "",
            "[Refrain: Billy Ray Cyrus]",
            "Yeah, I'm gonna take my horse to the old town road",
            "I'm gonna ride 'til I can't no more",
            "I'm gonna take my horse to the old town road",
            "I'm gonna ride 'til I can't no more",
            "(Kio, Kio)",
            "",
            "[Verse 1: Lil Nas X]",
            "I got the horses in the back",
            "Horse tack is attached",
            "Hat is matte black",
            "Got the boots that's black to match",
            "Ridin' on a horse, ha",
            "You can whip your Porsche",
            "I been in the valley",
            "You ain't been up off that porch, now",
            "",
            "[Chorus: Lil Nas X]",
            "Can't nobody tell me nothin'",
            "You can't tell me nothin'",
            "Can't nobody tell me nothin'",
            "You can't tell me nothin'",
            "",
            "[Verse 2: Lil Nas X]",
            "Ridin' on a tractor",
            "Lean all in my bladder",
            "Cheated on my baby",
            "You can go and ask her",
            "My life is a movie",
            "Bull ridin' and boobies",
            "Cowboy hat from Gucci",
            "Wrangler on my booty",
            "",
            "[Chorus: Lil Nas X]",
            "Can't nobody tell me nothin'",
            "You can't tell me nothin'",
            "Can't nobody tell me nothin'",
            "You can't tell me nothin'",
            "",
            "[Refrain: Lil Nas X]",
            "Yeah, I'm gonna take my horse to the old town road",
            "I'm gonna ride 'til I can't no more",
            "I'm gonna take my horse to the old town road",
            "I'm gonna ride 'til I can't no more",
            "",
            "[Verse 3: Billy Ray Cyrus]",
            "Hat down, cross town, livin' like a rockstar",
            "Spent a lot of money on my brand new guitar",
            "Baby's got a habit: diamond rings and Fendi sports bras",
            "Ridin' down Rodeo in my Maserati sports car",
            "Got no stress, I've been through all that",
            "I'm like a Marlboro Man so I kick on back",
            "Wish I could roll on back to that old town road",
            "I wanna ride 'til I can't no more",
            "",
            "[Outro: Lil Nas X & Billy Ray Cyrus]",
            "Yeah, I'm gonna take my horse to the old town road",
            "I'm gonna ride 'til I can't no more",
            "I'm gonna take my horse to the old town road",
            "I'm gonna ride 'til I can't no more"
        ]
    ],
    "Comments": [
        "Lil Nas X enlists established country singer Billy Ray Cyrus for a surprise remix of his smash breakout hit, “Old Town Road.” Cyrus previously co-signed the original song via Twitter, saying:",
        "Been watching everything going on with OTR. When I got thrown off the charts, Waylon Jennings said to me ‘Take this as a compliment’ means you’re doing something great! Only Outlaws are outlawed. Welcome to the club!",
        "Cyrus' feature comes in spite of the removal of the song from the Billboard Country charts, which sparked debate as to whether the original song qualified as a country song or was more closely aligned with hip-hop.",
        "Lil Nas X with Billy Ray Cyrus during the studio session for \"Old Town Road (Remix)\"",
        "Farsi Translation",
        "French Translation",
        "Portuguese Translation",
        "Russian Translation",
        "Spanish Translation",
        "Turkish Translation",
        "I have a few country songs. I’m not going to lie and say I’m this huge country fan, but I respect the genre, because I respect every genre of music.",
        "At first, I thought, “I’m just going to rap,” but then later on down the line, literally probably two, three songs before “Old Town Road,” it’s like, “I’m going to do what I want to do. I’m going to make the music I want to make, and if people like it, then they like it. If they don’t, then they don’t.” Before it was even taken off the country charts, I was just happy to be on Billboard at all. Even after they did take it off, I was like, “Okay, at least I’m still on Billboard.” Then, I started to think about, I was like, “Why?” After listening to other songs that’s actually on that chart, it’s like, “Wait a minute, something’s not right, basically.” Then it felt amazing to get support from country stars because it’s like this is their lane. It’s like you’re getting respect from people who’ve been doing this for some time. This is my first time dabbling into anything country influenced.",
        "I didn’t even know about the Nine Inch Nails sample at first. After I did find out about it, it was like, “Wow, so it’s rock, country, hip-hop all in the same room.” I am a Nine Inch Nails fan, but I wouldn’t say a hardcore fan. I know their most popular hits, something like that. I know “Closer,” I know “Hurt.” Honestly, it makes me feel great that I was able to put completely different worlds together and make a song that so many people like. Almost everybody who I’ve shown this song to, even people commenting comments like, “Hey, I hate this genre and that genre, but I like this song.”",
        "I released the song literally hours after I was finished in the studio. I couldn’t wait to put it out. I started pushing it on my Twitter account through memes. I was pushing it on my account for I guess a few months until it finally picked up on TikTok. Then, I didn’t have to do much after that because it’s been skyrocketing ever since to this day. One of the biggest memes was like this guy standing on a horse, and he’s riding it through some desert or something. Even Bleacher Report, they took that and they edited it. My favorite one though, it’s like this cat and it’s hitting a whip. It’s right on beat, even the clap.",
        "I found the beat on YouTube. I didn’t even meet Kio… I still haven’t met him face to face yet. We met through Instagram because he saw the song in a meme, and he found me. That’s how we met.",
        "Okay, so the real story behind “Old Town Road.” I dropped out of school and I started to do music. I started to live with my sister because I didn’t want to go back home because my parents was not gonna be having that. For one, they feel like music is not a realistic future for anybody. I was living with my sister, and she was ready for me to go, basically. It started off as this loner cowboy kind of vibe. It’s like running away from everything, basically. I found the beat in late October on YouTube and released the song early December. It was gonna be a serious kind of song with country influence, of course. A lot of my music before “Old Town Road,” I was just trying to make music I thought everybody wanted. I changed the meaning of it later on down the road from a runaways type of story to Old Town Road being a symbol for a path of success, where you’re just staying on it. The horse, me not having too much to work with, but getting to where you’re trying to go. It’s like, “I’m gonna take my horse to the old town road.” In the first verse, you’re getting everything packed up and ready to go. In the second verse, you’re in that lane now where everything’s going right. In the chorus, the, “Can’t nobody tell me nothin,” it was like a jab to my parents in a way. Wanting me to not really stop doing music, but to get back into school. It’s like, “Can’t nobody tell me nothin'.”",
        "Yes, on May 17th, 2019, Lil Nas X released the official music video on his channel, with special guest appearances from Chris Rock, Ha Ha Davis, Rico Nasty, Diplo, Jo'zzy, YoungKio, and Vince Staples.",
        "Yes! Lil Nas X and Billy Ray performed the song for the first time together on April 28th, 2019 during Diplo’s performance at Stagecoach Festival.",
        "The pair also went on to join Miley Cyrus to perform the track on the Pyramid Stage at Glastonbury Festival on June 30th, 2019.",
        "Yes… Lil Nas X posted a 2:38 minutes duration video of the song, titled as “Old Town Road (Week 17 Version) ft. Billy Ray Cyrus”, which is basically a Short-Video version, with full song in it!"
    ],
    "Title": "Lil Nas X – Old Town Road (Remix) Lyrics | Genius Lyrics",
    "Release date": "April 5, 2019"
}