{
    "Lyrics": [
        [
            "[Verse 1]",
            "Shakedown 1979",
            "Cool kids never have the time",
            "On a live wire right up off the street",
            "You and I should meet",
            "Junebug skippin' like a stone",
            "With the headlights pointed at the dawn",
            "We were sure we'd never see an end",
            "To it all",
            "",
            "[Chorus]",
            "And I don't even care",
            "To shake these zipper blues",
            "And we don't know",
            "Just where our bones will rest",
            "To dust I guess",
            "Forgotten and absorbed",
            "Into the earth below",
            "",
            "[Verse 2]",
            "Double-cross the vacant and the bored",
            "They're not sure just what we have in store",
            "Morphine city slippin' dues",
            "Down to see",
            "",
            "[Chorus 2]",
            "That we don't even care",
            "As restless as we are",
            "We feel the pull",
            "In the land of a thousand guilts",
            "And poured cement",
            "",
            "[Bridge]",
            "Lamented and assured",
            "To the lights and towns below",
            "Faster than the speed of sound",
            "Faster than we thought we'd go",
            "Beneath the sound of hope",
            "",
            "[Verse 3]",
            "Justine never knew the rules",
            "Hung down with the freaks and ghouls",
            "No apologies ever need be made",
            "I know you better than you fake it",
            "To see",
            "",
            "[Chorus 1]",
            "That we don't even care",
            "To shake these zipper blues",
            "And we don't know",
            "Just where our bones will rest",
            "To dust I guess",
            "Forgotten and absorbed",
            "Into the earth below",
            "",
            "[Outro]",
            "The street heats the urgency of now",
            "As you see there's no one around"
        ]
    ],
    "Comments": [
        "“1979” is an homage to youth and all the pain, angst, and happiness that goes along with it.  With a fusion of alternative rock, new wave, and electronics, the Pumpkins stumbled upon an atmospheric sound that seemed to define a generation.  At the time of the release, this track sounded much different than anything the industry had ever heard before. “1979” was the last song recorded for Mellon Collie and the Infinite Sadness. Billy Corgan believed it belonged on the album, and after being told an earlier version of it wasn’t good enough, revamped it in about four hours, eventually to his producer’s approval.",
        "The song is one of the band’s most popular and successful. Influential online magazine Pichfork ranked it as the 21st best song of the 1990s. In 2012 Rolling Stone readers voted it the second best Smashing Pumpkins song, with the publication calling it a “wistful pop hit.” The song was also nominated for Record of the Year and Best Rock Performance by a Group or Duo at the 39th Annual Grammy Awards, and its corresponding music video won “Best Alternative Video” at the 1996 MTV Music Video Awards.",
        "Billy Corgan doesn’t make a habit of explaining his lyrics.  He prefers not to as he believes it takes away from the song.  He would rather us all interpret his words the way we wish, tailoring them to suit our own situations.  Has has however made some vague comments regarding the lyrics:",
        "Somehow the lyric, which sings of an opposing sensuous world, balances all of my life on the head of a pin.",
        "He’s actually just humming and making random sounds that were then electronically processed.  He was asked this question in a magazine interview shortly after the song was released:",
        "The most frequently asked question about “1979” is, “What is the `ooh-ahh-ahh' sound at the end of every phrase?” Flood and I were tracking the song, and I started humming the “oohs” like a melody line. I sang them to tape, we sampled the pertinent ones, electronically manipulated them, and looped them against the drum beat.",
        "Jimmy Chamberlin did play live drums during the recording of “1979,” but not in the traditional way a drummer may be used to.  He explained the process to Modern Drummer magazine in 1996:",
        "Another different song for me was “1979,” which is a drum loop with me playing over the top of it. That’s the first time I’ve ever done anything like that.",
        "In 1996, Billy Corgan spoke about the making of “1979” to Guitar School:",
        "It was the last song [written for the album]… I demoed out the basic music for “1979,” and we practiced it a few times. Flood wanted to take the tune off the board so we wouldn’t spend more time on it, but I said, “Let me have one more day.” I went home and wrote the whole song that night, words and everything. The next day I came in, played the new demo for him, and he said “That’s it! It’s done!” That demo is still floating around somewhere, and it’s pretty damned weird.",
        "“1979” has a real immediacy to it; there’s just something about the riff and the vocal. The singles are always like that, though. They come to you pretty fast. It’s funny, because that melody is the very first melody I sang against the riff. Sometimes I have to “mine” the melody; you have to dig around until you find something good and solid, like “Today” and “Disarm” [from Siamese Dream]. Those were the first melodies I ever sang against the chords. And when you find melodies like that, everything seems to just fall into place effortlessly. It’s as though the song is already written, and you’re just trying to find the thread. It’s a weird feeling when you hit upon that. \"",
        "It seems very wrong to reduce an important band’s highest-charting single to one sound, but sorry, that whooshing progression that repeats through “1979” is amazing enough to hang a whole career on. That floating guitar figure seems to hold all the wistfulness, sadness, hope, and redemption that the Smashing Pumpkins wanted to get across in the 1990s, and everything else– and they released a ton of great music then, don’t let the last 10 years obscure that – was pretty much gravy. Somehow that riff and the song’s title – ‘79 was a pivotal year for Corgan’s generation, signaling the end of the last decade that would be spent only in childhood – must have motivated Billy Corgan to speak in straightforward and human terms. Here he wasn’t whining, he wasn’t throwing a tantrum, he didn’t want to be the voice of a generation or be someone’s therapist. Instead, he put together a cluster of images that was more about an undefined feeling than a message, and it happened to be the most universal sentiment he’d ever manage. “1979” was Billy Corgan asking, “You know this feeling?” and the second you heard that guitar line the immediate answer was, “I do – tell me more.”",
        "—Mark Richardson, for Pichfork"
    ],
    "Title": "The Smashing Pumpkins – 1979 Lyrics | Genius Lyrics",
    "Release date": "January 23, 1996"
}